[
  {
    "id": "jasmijn_hofwegen",
    "terms": [
      "Hofwegen Jasmijn",
      "Jasmijn Hofwegen"
    ],
    "content": "The disappearance of Kasper and Jasmijn Hofwegen. It has been seven years since they dissapeared from their home in Nieuw Demden. If anyone has seen any information. Posted three years ago by Miki Mori.\nIncluded with the article a picture of a blond teenager with a young man. The blond girl being the same as from the picture I found amongst Joan's belongings."
  }, {
    "id": "kasper_hofwegen",
    "terms": [
      "Hofwegen Kasper",
      "Kasper Hofwegen"
    ],
    "content": "Letter found that could be linked to the Hofwegen disappearance. Last Thursday the twenty-eight of January a letter was found on the doorstep of their former residence in Nieuw Demden. This is the first information since their disappearance two years ago. Investigators are unsure about the authenticity of the note. Until then any of the contents of the note is held secret by the police department. Posted eight years ago in The Edamder."
  }, {
    "id": "hofwegen_disappearance",
    "terms": [
      "Hofwegen disappearance",
      "disappearance Hofwegen"
    ],
    "content": "No new information in four years. The last known information came through a ransom note found on their doorstep four years ago, which was to believed by authorities to be fraudulent. [...]Posted eight years ago in The Edamder."
  }, {
    "id": "simone_bell",
    "terms": [
      "Bell Simone",
      "Simone Bell",
      "Simone Michelle Bell"
    ],
    "content": "A rising star amongst the local police department. \"Simone Michelle Bell has been promoted to criminal investigator after helped us close many cases over the past few months,\" according to Chief Saunders. She seems to be a vital component of the department as this is the second promotion in a single year. [...] Posted four months ago in Hoast Nais."
  }, {
    "id": "lars_green",
    "terms": [
      "Green Lars",
      "Lars Green"
    ],
    "content": "Lars Green, local entrepreneur and owner of Green Bakery."
  }, {
    "id": "green_bakery",
    "terms": [
      "Green Bakery"
    ],
    "content": "Green Bakery, located on Elmwood Street 24a, come visit us for your morning bread or any of our delicious treats all made by us by hand!\nI then realized that I have visited that place once or twice when I used to work in the area. Not a large store, but it looked quite cosy and the food tasted phenomenal."
  }, {
    "id": "miki_mori",
    "terms": [
      "Mori Miki",
      "Miki Mori"
    ],
    "content": "Miki Mori @morimiki1984, independent journalist and consultant investigator, living Kensington Road 141."
  }, {
    "id": "ron_dekker",
    "terms": [
      "Dekker Ron",
      "Ron Dekker"
    ],
    "content": "Hello, how you're doing? Thank you so much for playing. I hope you like the game so far, best of luck! -The developer"
  }
]